{
    "key": "TutorialData",
    "allMessages": [
        {
            "messages": [
                "Oh good, you're awake.  We have much to discuss.  You can use <b>LEFT CLICK</b> to speed through my messages, as well as continue our conversation.",
                "I've been waiting years for you to finally awaken.  I hope you will be different then all the previous.",
                "Since you woke up in the middle of the night, we'll only face a few humans tonight.  I can show you the ropes, but you'll be on your own after tonight.",
                "As you can see, I've provided you with a simple pistol to defend yourself.  I'll see if I can have Fred find you better weapons to use as the nights progress.",
                "Use <b>WASD</b> to head over to the teleporter in the center and head to the surface.  I dug a few pits around the teleporter, so you should be safe after teleporting."
            ]
        },
        {
            "messages": [
                "Oh no!  It looks like an archer was waiting for you!  Use <b>SPACEBAR</b> to safely travel through the arrow and cross the pit."
            ]
        },
        {
            "messages": [
                "Nice work.  Use <b>LEFT CLICK</b> to shoot your pistol and kill the archer, and <b>R</b> to reload."
            ]
        },
        {
            "messages": [
                "Great job!  Before more humans show up, let me explain the situation a little more.",
                "I was able to reanimate you with a bit of magic, but we have a problem.",
                "Due to the nature of my magic, the nearby town was alerted and are sending people to banish you back to the underworld.",
                "If they are able to build all 3 pedestals, you will be banished.  On top of fighting the humans, you'll need to prevent them from building these pedestals.",
                "It looks like there's still a pedestal from your predecessor.  Constructed pedestals are shown with red arrows.  Go destroy it! (<b>LEFT CLICK</b>)"
            ]
        },
        {
            "messages": [
                "Sweet.  As you can see, breaking the pedestal increased your max health from 2 to 3.  You'll want to keep the humans from creating pedestals to stay strongest.",
                "I think I can hear a few more humans coming.  Try and survive the best you can!  I'll be back once day hits."
            ]
        },
        {
            "messages": [
                "It looks like it's becoming day.  Since humans can only construct the pedestals during the night, they're going to head back to their village if you hide.",
                "Head back to the teleporter in the center of the graveyard to return to your crypt.  We can gear you up and stay safe during the day there."
            ]
        },
        {
            "messages": [
                "Oh no!  It looks like the humans got to you.  Luckily, since I'm here, we can restart training."
            ]
        }
    ]
}